?- ['sde3.pro'].
Welcome to SDE3 (Version 4.1.1)
Copyright (C) 2017 Curtis John Laurence.
SDE3 comes with absolutely no Warranty.
This is free software and you are free to redistribute it.
See LICENSE for details
true.

?- mu(((1, 7), [(1, 0.0), (2, 0.5), (3, 0.7), (4, 0.8), (5, 0.8), (6, 0.25), (7, 0.3)])).
true.

?- mu(((1, 7), [(1, 0.0), (2, 0.5), (3, 0.7), (4, 0.8), (5, 0.8), (6, 0.25), (7.0, 0.3)])).
false.

?- mu(((1, 7.0), [(1, 0.0), (2, 0.5), (3, 0.7), (4, 0.8), (5, 0.8), (6, 0.25), (7, 0.3)])).
false.

?- mu(((1, 1), [(1, 0.0)])).
true.

?- mu(((1, 1), [])).
false.

?- mu(((1, 3), [(1, 0.0), (2, 0.1)])).
false.

?- mu(((1, 3), [(1, 0.0), (2, 0.1), (3, 0.75)])).
true.

?- mu(((1, 3), [(1, 0.0), (3, 0.1), (2, 0.75)])).
false.

?- mu(((1, 7), [(1, 0.0), (2, 0.5), (3, 0.7), (4, 0.8), (5, 0.8), (6, 0.25), (7, 0.3), (8, 1.0), (9, 0.3), (10, 0.0)])).
false.

?- mu(((1, 10), [(1, 0.0), (2, 0.5), (3, 0.7), (4, 0.8), (5, 0.8), (6, 0.25), (7, 0.3), (8, 1.0), (9, 0.3), (10, 0.0)])).
true.

